docs/rfc/0002-perf-data/warm/k6-gates-on.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/sanketsudake/fission/fission/test/benchmark/tests/warm-path/sample.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m30s max duration (incl. graceful stop):
              * warm: 20 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 3631 complete and 0 interrupted iterations
warm   [   2% ] 20 VUs  0m01.0s/1m0s

running (0m02.0s), 20/20 VUs, 7420 complete and 0 interrupted iterations
warm   [   3% ] 20 VUs  0m02.0s/1m0s

running (0m03.0s), 20/20 VUs, 11600 complete and 0 interrupted iterations
warm   [   5% ] 20 VUs  0m03.0s/1m0s

running (0m04.0s), 20/20 VUs, 15635 complete and 0 interrupted iterations
warm   [   7% ] 20 VUs  0m04.0s/1m0s

running (0m05.0s), 20/20 VUs, 18346 complete and 0 interrupted iterations
warm   [   8% ] 20 VUs  0m05.0s/1m0s

running (0m06.0s), 20/20 VUs, 22252 complete and 0 interrupted iterations
warm   [  10% ] 20 VUs  0m06.0s/1m0s

running (0m07.0s), 20/20 VUs, 25228 complete and 0 interrupted iterations
warm   [  12% ] 20 VUs  0m07.0s/1m0s

running (0m08.0s), 20/20 VUs, 28811 complete and 0 interrupted iterations
warm   [  13% ] 20 VUs  0m08.0s/1m0s

running (0m09.0s), 20/20 VUs, 32137 complete and 0 interrupted iterations
warm   [  15% ] 20 VUs  0m09.0s/1m0s

running (0m10.0s), 20/20 VUs, 35301 complete and 0 interrupted iterations
warm   [  17% ] 20 VUs  0m10.0s/1m0s

running (0m11.0s), 20/20 VUs, 38454 complete and 0 interrupted iterations
warm   [  18% ] 20 VUs  0m11.0s/1m0s

running (0m12.0s), 20/20 VUs, 42164 complete and 0 interrupted iterations
warm   [  20% ] 20 VUs  0m12.0s/1m0s

running (0m13.0s), 20/20 VUs, 46274 complete and 0 interrupted iterations
warm   [  22% ] 20 VUs  0m13.0s/1m0s

running (0m14.0s), 20/20 VUs, 50047 complete and 0 interrupted iterations
warm   [  23% ] 20 VUs  0m14.0s/1m0s

running (0m15.0s), 20/20 VUs, 53504 complete and 0 interrupted iterations
warm   [  25% ] 20 VUs  0m15.0s/1m0s

running (0m16.0s), 20/20 VUs, 57685 complete and 0 interrupted iterations
warm   [  27% ] 20 VUs  0m16.0s/1m0s

running (0m17.0s), 20/20 VUs, 60348 complete and 0 interrupted iterations
warm   [  28% ] 20 VUs  0m17.0s/1m0s

running (0m18.0s), 20/20 VUs, 63623 complete and 0 interrupted iterations
warm   [  30% ] 20 VUs  0m18.0s/1m0s

running (0m19.0s), 20/20 VUs, 66754 complete and 0 interrupted iterations
warm   [  32% ] 20 VUs  0m19.0s/1m0s

running (0m20.0s), 20/20 VUs, 70585 complete and 0 interrupted iterations
warm   [  33% ] 20 VUs  0m20.0s/1m0s

running (0m21.0s), 20/20 VUs, 73472 complete and 0 interrupted iterations
warm   [  35% ] 20 VUs  0m21.0s/1m0s

running (0m22.0s), 20/20 VUs, 76927 complete and 0 interrupted iterations
warm   [  37% ] 20 VUs  0m22.0s/1m0s

running (0m23.0s), 20/20 VUs, 79953 complete and 0 interrupted iterations
warm   [  38% ] 20 VUs  0m23.0s/1m0s

running (0m24.0s), 20/20 VUs, 83632 complete and 0 interrupted iterations
warm   [  40% ] 20 VUs  0m24.0s/1m0s

running (0m25.0s), 20/20 VUs, 87479 complete and 0 interrupted iterations
warm   [  42% ] 20 VUs  0m25.0s/1m0s

running (0m26.0s), 20/20 VUs, 91280 complete and 0 interrupted iterations
warm   [  43% ] 20 VUs  0m26.0s/1m0s

running (0m27.0s), 20/20 VUs, 95604 complete and 0 interrupted iterations
warm   [  45% ] 20 VUs  0m27.0s/1m0s

running (0m28.0s), 20/20 VUs, 99894 complete and 0 interrupted iterations
warm   [  47% ] 20 VUs  0m28.0s/1m0s

running (0m29.0s), 20/20 VUs, 104164 complete and 0 interrupted iterations
warm   [  48% ] 20 VUs  0m29.0s/1m0s

running (0m30.0s), 20/20 VUs, 108485 complete and 0 interrupted iterations
warm   [  50% ] 20 VUs  0m30.0s/1m0s

running (0m31.0s), 20/20 VUs, 113176 complete and 0 interrupted iterations
warm   [  52% ] 20 VUs  0m31.0s/1m0s

running (0m32.0s), 20/20 VUs, 117895 complete and 0 interrupted iterations
warm   [  53% ] 20 VUs  0m32.0s/1m0s

running (0m33.0s), 20/20 VUs, 122292 complete and 0 interrupted iterations
warm   [  55% ] 20 VUs  0m33.0s/1m0s

running (0m34.0s), 20/20 VUs, 126971 complete and 0 interrupted iterations
warm   [  57% ] 20 VUs  0m34.0s/1m0s

running (0m35.0s), 20/20 VUs, 131521 complete and 0 interrupted iterations
warm   [  58% ] 20 VUs  0m35.0s/1m0s

running (0m36.0s), 20/20 VUs, 136002 complete and 0 interrupted iterations
warm   [  60% ] 20 VUs  0m36.0s/1m0s

running (0m37.0s), 20/20 VUs, 140277 complete and 0 interrupted iterations
warm   [  62% ] 20 VUs  0m37.0s/1m0s

running (0m38.0s), 20/20 VUs, 144825 complete and 0 interrupted iterations
warm   [  63% ] 20 VUs  0m38.0s/1m0s

running (0m39.0s), 20/20 VUs, 149250 complete and 0 interrupted iterations
warm   [  65% ] 20 VUs  0m39.0s/1m0s

running (0m40.0s), 20/20 VUs, 153688 complete and 0 interrupted iterations
warm   [  67% ] 20 VUs  0m40.0s/1m0s

running (0m41.0s), 20/20 VUs, 157816 complete and 0 interrupted iterations
warm   [  68% ] 20 VUs  0m41.0s/1m0s

running (0m42.0s), 20/20 VUs, 162137 complete and 0 interrupted iterations
warm   [  70% ] 20 VUs  0m42.0s/1m0s

running (0m43.0s), 20/20 VUs, 166389 complete and 0 interrupted iterations
warm   [  72% ] 20 VUs  0m43.0s/1m0s

running (0m44.0s), 20/20 VUs, 170458 complete and 0 interrupted iterations
warm   [  73% ] 20 VUs  0m44.0s/1m0s

running (0m45.0s), 20/20 VUs, 174964 complete and 0 interrupted iterations
warm   [  75% ] 20 VUs  0m45.0s/1m0s

running (0m46.0s), 20/20 VUs, 179451 complete and 0 interrupted iterations
warm   [  77% ] 20 VUs  0m46.0s/1m0s

running (0m47.0s), 20/20 VUs, 183891 complete and 0 interrupted iterations
warm   [  78% ] 20 VUs  0m47.0s/1m0s

running (0m48.0s), 20/20 VUs, 187063 complete and 0 interrupted iterations
warm   [  80% ] 20 VUs  0m48.0s/1m0s

running (0m49.0s), 20/20 VUs, 190864 complete and 0 interrupted iterations
warm   [  82% ] 20 VUs  0m49.0s/1m0s

running (0m50.0s), 20/20 VUs, 193658 complete and 0 interrupted iterations
warm   [  83% ] 20 VUs  0m50.0s/1m0s

running (0m51.0s), 20/20 VUs, 196675 complete and 0 interrupted iterations
warm   [  85% ] 20 VUs  0m51.0s/1m0s

running (0m52.0s), 20/20 VUs, 199188 complete and 0 interrupted iterations
warm   [  87% ] 20 VUs  0m52.0s/1m0s

running (0m53.0s), 20/20 VUs, 201685 complete and 0 interrupted iterations
warm   [  88% ] 20 VUs  0m53.0s/1m0s

running (0m54.0s), 20/20 VUs, 204481 complete and 0 interrupted iterations
warm   [  90% ] 20 VUs  0m54.0s/1m0s

running (0m55.0s), 20/20 VUs, 206832 complete and 0 interrupted iterations
warm   [  92% ] 20 VUs  0m55.0s/1m0s

running (0m56.0s), 20/20 VUs, 207931 complete and 0 interrupted iterations
warm   [  93% ] 20 VUs  0m56.0s/1m0s

running (0m57.0s), 20/20 VUs, 208987 complete and 0 interrupted iterations
warm   [  95% ] 20 VUs  0m57.0s/1m0s

running (0m58.0s), 20/20 VUs, 210769 complete and 0 interrupted iterations
warm   [  97% ] 20 VUs  0m58.0s/1m0s

running (0m59.0s), 20/20 VUs, 211358 complete and 0 interrupted iterations
warm   [  98% ] 20 VUs  0m59.0s/1m0s

running (1m00.0s), 20/20 VUs, 212817 complete and 0 interrupted iterations
warm   [ 100% ] 20 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    checks_total.......: 212837  3543.432213/s
    checks_succeeded...: 100.00% 212837 out of 212837
    checks_failed......: 0.00%   0 out of 212837

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=5.6ms  min=1ms    med=4.62ms p(90)=7.87ms p(95)=10.27ms p(99)=22.1ms  max=259.13ms
      { expected_response:true }...: avg=5.6ms  min=1ms    med=4.62ms p(90)=7.87ms p(95)=10.27ms p(99)=22.1ms  max=259.13ms
    http_req_failed................: 0.00%  0 out of 212837
    http_reqs......................: 212837 3543.432213/s

    EXECUTION
    iteration_duration.............: avg=5.63ms min=1.01ms med=4.65ms p(90)=7.91ms p(95)=10.33ms p(99)=22.23ms max=259.17ms
    iterations.....................: 212837 3543.432213/s
    vus............................: 20     min=20          max=20
    vus_max........................: 20     min=20          max=20

    NETWORK
    data_received..................: 38 MB  627 kB/s
    data_sent......................: 18 MB  294 kB/s



running (1m00.1s), 00/20 VUs, 212837 complete and 0 interrupted iterations
warm ✓ [ 100% ] 20 VUs  1m0s